# Аналитика ЕГЭ  
## версия №2.1
### данная программа открывает файл (файлы) из папки ege и считывает данные (файлы в таблице *.xls).
### программа создает новый файл в формате analytics.xlsx

In [80]:
#подключаем библиотеки
import os
import pandas as pd

## Функция перевода + и - в 1 и 0
#### в некоторых предметах кроме + и - встречаются цифры (они останутся без изменений)

In [82]:
def plusToNum(s):
    st=''
    for i in s:
        if i == '+':
            st+='1'
        elif i == '-': 
            st +='0'
        else:
            st += i
    arr = [int(i) for i in st]
    return arr

### Считываем файлы из папки
#### (файлы должны быть по одному предмету)

In [83]:
import os
f  = os.listdir()
Files = ['./ege/'+i for i in os.listdir('./ege') if 'xls' in i]
if Files:
    print(Files)
else:
    print('folder is empty')

['./ege/русский.xls']

## уберем лишнии столбцы и выбирим строчку для шапки

In [84]:
table = pd.read_excel(Files[0].strip(), header = 6)
table.drop(table.columns[[0, 1,3,5,7,9,11,15,17,19,21,23,25]], axis=1, inplace=True)
#rus = rus[:33]
# тут была проблема в русском языке
table.head()

,Код МСУ,Код ОО,Класс,Код ППЭ,Аудитория,Фамилия,Имя,Отчество,Серия,Номер,Задания с кратким ответом,Задания с развёрнутым ответом,Первичный балл,Балл
0,901.0,404004.0,11Б,801.0,17.0,Панина,Виктория,Вячеславовна,3214.0,446917.0,2+++++5+++++++2+++++++++4,1(1)3(3)1(1)2(3)2(2)1(2)2(3)3(3)2(2)1(2)1(1)1(1),54.0,91.0
1,901.0,404004.0,11Б,801.0,15.0,Панфилова,Наталья,Андреевна,3214.0,413874.0,2+++++5-++++++2+++++-+++3,1(1)3(3)1(1)3(3)2(2)2(2)3(3)3(3)2(2)2(2)1(1)1(1),55.0,94.0
2,901.0,404004.0,11В,801.0,14.0,Никитенкова,Анна,Евгеньевна,3213.0,387022.0,1+++++5+++++++2-++++-+++4,1(1)3(3)1(1)3(3)2(2)2(2)2(3)2(3)2(2)2(2)1(1)1(1),53.0,89.0
3,901.0,404004.0,11А,801.0,31.0,Никитчук,Екатерина,Евгеньевна,3214.0,491921.0,2-++++5+++++++2+++++++++4,1(1)3(3)1(1)3(3)2(2)2(2)3(3)3(3)2(2)2(2)1(1)1(1),57.0,98.0
4,901.0,404004.0,11А,801.0,16.0,Попова,Валерия,Дмитриевна,3214.0,413304.0,2+++++2++++++-1--++-+-++4,1(1)3(3)1(1)3(3)2(2)2(2)3(3)3(3)1(2)2(2)1(1)1(1),48.0,78.0

## Меняем имена столбцов
### долго не мог найти такой простой способ )

In [86]:
#rus = rus.rename(columns = ['kod','kod2','class','kodPPE','room','Last name', 'First name', 'Second name','doc_s','doc_number','result_1','result_2','first_ball','ball'])
#table3 = pd.DataFrame(columns=['kod','kod2','class','kodPPE','room','Last name', 'First name', 'Second name','doc_s','doc_number','result_1','result_2','first_ball','ball'])
cols = ['kod','kod2','class','kodPPE','room','Last name', 'First name', 'Second name','doc_s','doc_number','result_1','result_2','first_ball','ball']
table.columns = cols
# функция dropna удаляет строки где есть значения NaN 
table = table.dropna(subset=['kod'])
table[:3]

,kod,kod2,class,kodPPE,room,Last name,First name,Second name,doc_s,doc_number,result_1,result_2,first_ball,ball
0,901.0,404004.0,11Б,801.0,17.0,Панина,Виктория,Вячеславовна,3214.0,446917.0,2+++++5+++++++2+++++++++4,1(1)3(3)1(1)2(3)2(2)1(2)2(3)3(3)2(2)1(2)1(1)1(1),54.0,91.0
1,901.0,404004.0,11Б,801.0,15.0,Панфилова,Наталья,Андреевна,3214.0,413874.0,2+++++5-++++++2+++++-+++3,1(1)3(3)1(1)3(3)2(2)2(2)3(3)3(3)2(2)2(2)1(1)1(1),55.0,94.0
2,901.0,404004.0,11В,801.0,14.0,Никитенкова,Анна,Евгеньевна,3213.0,387022.0,1+++++5+++++++2-++++-+++4,1(1)3(3)1(1)3(3)2(2)2(2)2(3)2(3)2(2)2(2)1(1)1(1),53.0,89.0

### готовим шапку таблицы
# шапку таблицы нужно сделать не зависимой

In [87]:
# количество заданий в первой части
number = len(table.result_1[1])
# готовим шапку
table2 = pd.DataFrame(columns=['Last name'] + [str(i+1) for i in range(number)]+['summa'])
table2.head()

Empty DataFrame
Columns: [Last name, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, summa]
Index: []

[0 rows x 27 columns]


## Обрабатываем данные для одного или более файлов единного предмета
### это уневерсальный способ, который заменет, то что было выше (table)

In [88]:
row = 0
for i in Files:
    table3 = pd.read_excel(Files[0].strip(), header = 6)
    table3.drop(table3.columns[[0, 1,3,5,7,9,11,15,17,19,21,23,25]], axis=1, inplace=True)
    table3.columns = cols
    # функция dropna удаляет строки где есть значения NaN 
    table3 = table3.dropna(subset=['kod'])
    for t,k in enumerate(table3['result_1']):
        buf = plusToNum(k)
        table2.loc[t+row] = [table3['Last name'][t]]+[j for j in buf]+[sum(buf)]
    row += t+1
table2[:5]

,Last name,1,2,3,4,5,6,7,8,9,...,17,18,19,20,21,22,23,24,25,summa
0,Панина,2,1,1,1,1,1,5,1,1,...,1,1,1,1,1,1,1,1,4,34
1,Панфилова,2,1,1,1,1,1,5,0,1,...,1,1,1,1,0,1,1,1,3,31
2,Никитенкова,1,1,1,1,1,1,5,1,1,...,1,1,1,1,0,1,1,1,4,31
3,Никитчук,2,0,1,1,1,1,5,1,1,...,1,1,1,1,1,1,1,1,4,33
4,Попова,2,1,1,1,1,1,2,1,1,...,0,1,1,0,1,0,1,1,4,25